# Пользователь Василий очень часто злоупотребляет восклицательными знаками!
# Напишите программу, которая будет заменять восклицательные знаки на точки.
# Пример строки: «Вася самый умный! Вася лучше всех! И ждет его успех! Вот так!»

text = "Вася самый дурной! Вася лучше всех кого я знаю! И ждут его за углом! Вот такие вот дела!"

# TODO: your code here

text = text.replace("!", ".")

print(text)

# Важно! Ваше решение должно работать не только с данной строкой, но и слюбой другой.
# Проверьте это, заменив текст примера на любой другой.
