# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

def can_triangle(p1, p2, p3):
    # a = ((p1[0]-p2[0])**2+(p1[1]-p2[1])**2)**0.5
    # b = ((p3[0]-p2[0])**2+(p3[1]-p2[1])**2)**0.5
    # c = ((p1[0]-p3[0])**2+(p1[1]-p3[1])**2)**0.5
    # return a + b > c and a + c > b and b + c > a
    a = distance(*p1, *p2)
    b = distance(*p2, *p3)
    c = distance(*p1, *p3)
    return a + b > c and a + c > b and b + c > a


def distance(x1, y1, x2, y2):
    return ((x1 - x2) ** 2 + (y1 - y2) ** 2) ** 0.5


# Пример вызова функции
if can_triangle((10, 12), (14, 18), (12, 12)):
    print("Можно")
# Не забудьте протестировать вашу функцию
