# При решении различных задач данной практики вы написали некоторое количество функций. В
# озможно, в дальнейшем вы захотите использовать эти функции повторно и в других своих программах.
# Организуем свою библиотеку функций.
# В корне вашего проект создайте папку Library(это будет пакет)
# В папке Library создайте файл my_lib.py(это и будет ваш библиотечный файл)
# Все функции разместите в файле my_lib.py
# Решения всех задач, использующих ваши функции, разместите в отдельном(отдельных - на ваше усмотрение) файле(файлах),
# а используемые функции импортируйте из my_lib.py

from Library.my_lib import *

print(time(5696))

print(days_in_year(1996))

print(fib(10))

print(gen_list(10, 10, 50))
