# С некоторого момента прошло некоторое количество дней. Сколько полных недель прошло с этого же момента?
# Формат входных данных: Вводится целое положительное число — количество прошедших дней.
# Формат выходных данных: Выведите целое число недель.
print('Подсчет количества полных недель на отрезке времени в днях')
days = int(input('Введите количество дней: '))
print(f'Количество полных недель составит {days//7}')
